### Import necessary module

In [49]:
import numpy as np
import pandas as pd

### Read and combine test and train dataset

In [51]:
train_df=pd.read_csv(r'C:\Graduate Courses\Spring 2020\titanic\train.csv')
test_df=pd.read_csv(r'C:\Graduate Courses\Spring 2020\titanic\test.csv')
combine=train_df.append(test_df)

In [52]:
combine.columns

Index(['Age', 'Cabin', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId',
       'Pclass', 'Sex', 'SibSp', 'Survived', 'Ticket'],
      dtype='object')

In [64]:
combine.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450

### Data Types

In [54]:
combine.dtypes

Age            float64
Cabin           object
Embarked        object
Fare           float64
Name            object
Parch            int64
PassengerId      int64
Pclass           int64
Sex             object
SibSp            int64
Survived       float64
Ticket          object
dtype: object

### Missing Values

In [55]:
combine.isnull().sum()

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
dtype: int64

### Dataframe Numerical Variables

In [56]:
df_num=combine.filter(['SibSp', 'Parch', 'Age', 'Fare'])

In [57]:
df_num_des=df_num.describe()
df_num_des

             SibSp        Parch          Age         Fare
count  1309.000000  1309.000000  1046.000000  1308.000000
mean      0.498854     0.385027    29.881138    33.295479
std       1.041658     0.865560    14.413493    51.758668
min       0.000000     0.000000     0.170000     0.000000
25%       0.000000     0.000000    21.000000     7.895800
50%       0.000000     0.000000    28.000000    14.454200
75%       1.000000     0.000000    39.000000    31.275000
max       8.000000     9.000000    80.000000   512.329200

In [30]:
df_num_des.to_csv('df_num_des.csv')

### Dataframe for categorical variable

In [58]:
df_cat=combine.filter(['Survived','Pclass', 'Sex','Embarked'])

In [60]:
df_cat['Survived']=df_cat['Survived'].replace(to_replace =[0,1], value =['No','Yes'])
df_cat['Pclass']=df_cat['Pclass'].replace(to_replace =[1,2,3], value =['1st','2nd','3rd'])

In [61]:
df_cat

    Survived Pclass     Sex Embarked
0         No    3rd    male        S
1        Yes    1st  female        C
2        Yes    3rd  female        S
3        Yes    1st  female        S
4         No    3rd    male        S
..       ...    ...     ...      ...
413      NaN    3rd    male        S
414      NaN    1st  female        C
415      NaN    3rd    male        S
416      NaN    3rd    male        S
417      NaN    3rd    male        C

[1309 rows x 4 columns]

In [62]:
df_cat_des=df_cat.describe()
df_cat_des.to_csv('df_cat_des.csv')